app/views/users/show.html.erb

  <%= link_to "Add Word", new_word_path %>
  <% @user.words.each do |word| %>
---
SELECT "words".* FROM "words" INNER JOIN "user_words" ON "words"."id" = "user_words"."word_id" WHERE "user_words"."user_id" = $1  [["user_id", 1]]

  <strong>List of Poems:</strong>
  <% @user.poems.each do |poem| %>
---
SELECT "poems".* FROM "poems" INNER JOIN "user_poems" ON "poems"."id" = "user_poems"."poem_id" WHERE "user_poems"."user_id" = $1  [["user_id", 3]]