app/controllers/application_controller.rb

    def get_user
        if (session[:user_id])
            @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]