app/controllers/users_controller.rb

SELECT "poems".* FROM "poems"
---
  def show
    if (session[:user_id])
      @poems = Poem.all

INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "user_words" WHERE "user_words"."id" = $1  [["id", 2]]
SELECT  "user_words".* FROM "user_words" WHERE "user_words"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT "user_poems".* FROM "user_poems" WHERE "user_poems"."user_id" = $1  [["user_id", 2]]
---
  def destroy
    UserWord.where(user_id: @user.id).destroy_all
    UserPoem.where(user_id: @user.id).destroy_all