app/controllers/words_controller.rb

INSERT INTO "user_words" ("word_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["word_id", 5], ["user_id", 2], ["created_at", "2019-07-11 16:44:32.907759"], ["updated_at", "2019-07-11 16:44:32.907759"]]
INSERT INTO "words" ("name", "audio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Spoon"], ["audio", "n/a"], ["created_at", "2019-07-09 00:03:58.220029"], ["updated_at", "2019-07-09 00:03:58.220029"]]
---
  def create
    @word = Word.new(word_params)

    respond_to do |format|
      if @word.save

UPDATE "words" SET "name" = ?, "audio" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["name", ""], ["audio", ""], ["updated_at", "2019-07-09 00:13:55.194949"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @word.update(word_params)

DELETE FROM "user_words" WHERE "user_words"."id" = $1  [["id", 1]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 1]]
---
  def destroy
    @word.destroy

SELECT "user_words".* FROM "user_words" WHERE "user_words"."word_id" = $1  [["word_id", 3]]
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_word
      @word = Word.find(params[:id])