app/controllers/words_controller.rb

  def create
    @word = Word.new(word_params)

    respond_to do |format|
      if @word.save
---
INSERT INTO "user_words" ("word_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["word_id", 5], ["user_id", 2], ["created_at", "2019-07-11 16:44:32.907759"], ["updated_at", "2019-07-11 16:44:32.907759"]]
INSERT INTO "words" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "dog"], ["created_at", "2019-07-11 16:11:41.325428"], ["updated_at", "2019-07-11 16:11:41.325428"]]

  def destroy
    @word.destroy
---
DELETE FROM "user_words" WHERE "user_words"."id" = $1  [["id", 1]]

  def set_word
    @word = Word.find(params[:id])
---
SELECT  "user_words".* FROM "user_words" WHERE "user_words"."word_id" = $1 LIMIT $2  [["word_id", 5], ["LIMIT", 1]]
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]